package ru.gds.spring.mongo.changelog;

import com.github.cloudyrock.mongock.ChangeLog;
import com.github.cloudyrock.mongock.ChangeSet;
import org.springframework.data.mongodb.core.MongoTemplate;
import ru.gds.spring.microservice.domain.BookContent;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Date;

@ChangeLog(order = "001")
public class DatabaseChangelog {

    @ChangeSet(order = "001", id = "addBookContents", author = "dgvozdev")
    public void insertBookContents(MongoTemplate template) {

        template.save(new BookContent(
                "1",
                "1",
                "Тестовая книга",
                new Date(),
                "C:\\Users\\Денис\\Desktop\\txt и xml\\книги\\NickPerumovChernoeKopye.txt",
                "NickPerumovChernoeKopye.txt",
                4,
                new ArrayList<>(Arrays.asList(
                "Глава 1\n" +
                "Начало\n" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст"
                ,
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст"
                ,
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст" +
                "текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст"))
        ));
    }
}
